grouper-ws/grouper-ws/doc/xmlExamples/viewOrEditPrivilegesSimpleSoapRequest.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
  <soapenv:Body>
    <ns1:viewOrEditPrivilegesSimple xmlns:ns1="http://webservices.grouper.middleware.internet2.edu/xsd">
      <ns1:groupName>aStem:aGroup</ns1:groupName>
      <ns1:groupUuid></ns1:groupUuid>
      <ns1:subjectId>10021368</ns1:subjectId>
      <ns1:subjectIdentifier></ns1:subjectIdentifier>
      <ns1:adminAllowed></ns1:adminAllowed>
      <ns1:optinAllowed>T</ns1:optinAllowed>
      <ns1:optoutAllowed>F</ns1:optoutAllowed>
      <ns1:readAllowed></ns1:readAllowed>
      <ns1:updateAllowed></ns1:updateAllowed>
      <ns1:viewAllowed></ns1:viewAllowed>
      <ns1:actAsSubjectId>GrouperSystem</ns1:actAsSubjectId>
      <ns1:actAsSubjectIdentifier></ns1:actAsSubjectIdentifier>
    </ns1:viewOrEditPrivilegesSimple>
  </soapenv:Body>
</soapenv:Envelope>